brew "curl"
brew "cmake"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "neovim"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "p7zip"
brew "ripgrep"
brew "tmux"
brew "tree-sitter"
brew "wget"

cask "claude-code"
cask "codex"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "lm-studio"
cask "miniconda"
cask "numi"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "zen"
